In [1]:
import pandas as pd
from io import StringIO

In [2]:
ruta_excel = 'D:/Cursos/ds_ml_18dias/07-dia 7/26.1 Compras_desde_ads.xlsx'
ruta_xml = 'D:/Cursos/ds-ml-18dias/07-dia 7/26.2 Valores de acciones.xml'

In [3]:
%pwd

'D:\\Cursos\\ds_ml_18dias\\07-dia 7\\Día 7\\Cuadernos para Prácticas'

In [4]:
df1 = pd.read_excel(ruta_excel)
df1

     Id_usuario     Genero  Edad  Salario_estimado  Comprado
0      15624510  Masculino    19             19000         0
1      15810944  Masculino    35             20000         0
2      15668575   Femenino    26             43000         0
3      15603246   Femenino    27             57000         0
4      15804002  Masculino    19             76000         0
..          ...        ...   ...               ...       ...
395    15691863   Femenino    46             41000         1
396    15706071  Masculino    51             23000         1
397    15654296   Femenino    50             20000         1
398    15755018  Masculino    36             33000         0
399    15594041   Femenino    49             36000         1

[400 rows x 5 columns]

In [5]:
#df2 = pd.read_xml(ruta_xml)
#df2

In [6]:
numeros = {
    'romanos': ['I', 'II', 'III', 'IV'],
    'arabigos': [1, 2, 3, 4],
    'texto': ['uno', 'dos', 'tres', 'cuatro']
}

In [7]:
df = pd.DataFrame(numeros)
df

  romanos  arabigos   texto
0       I         1     uno
1      II         2     dos
2     III         3    tres
3      IV         4  cuatro

In [8]:
df['Fechas'] = pd.Series(pd.date_range('20240101', periods=4))
df

  romanos  arabigos   texto     Fechas
0       I         1     uno 2024-01-01
1      II         2     dos 2024-01-02
2     III         3    tres 2024-01-03
3      IV         4  cuatro 2024-01-04

In [10]:
df.to_excel('D:/Cursos/ds_ml_18dias/07-dia 7/jeo2.xlsx', index=False)

In [11]:
df.to_csv('D:/Cursos/ds_ml_18dias/07-dia 7/jeo2.csv', index=False)